In [2]:
import pandas as pd
df1 = pd.read_csv('gender2.csv', encoding='ANSI')
df2 = df1[["2022년_계_총인구수", "2022년_남_총인구수", "2022년_여_총인구수"]]
df2

   2022년_계_총인구수 2022년_남_총인구수 2022년_여_총인구수
0    51,439,038   25,636,951   25,802,087
1     9,428,372    4,570,048    4,858,324
2     3,317,812    1,619,915    1,697,897
3     2,363,691    1,162,865    1,200,826
4     2,967,314    1,485,175    1,482,139
5     1,431,050      707,299      723,751
6     1,446,072      721,245      724,827
7     1,110,663      570,368      540,295
8       383,591      191,389      192,202
9    13,589,432    6,839,276    6,750,156
10    1,536,498      772,947      763,551
11    1,595,058      810,782      784,276
12    2,123,037    1,086,632    1,036,405
13    1,769,607      880,592      889,015
14    1,817,697      915,272      902,425
15    2,600,492    1,311,881    1,288,611
16    3,280,493    1,651,675    1,628,818
17      678,159      339,590      338,569

In [3]:
# 총 인구수 total, 남 총 인구수(Male), 여 총 인구수(Female)
df2.columns = ["Total", "Male", "Female"]
df2

         Total        Male      Female
0   51,439,038  25,636,951  25,802,087
1    9,428,372   4,570,048   4,858,324
2    3,317,812   1,619,915   1,697,897
3    2,363,691   1,162,865   1,200,826
4    2,967,314   1,485,175   1,482,139
5    1,431,050     707,299     723,751
6    1,446,072     721,245     724,827
7    1,110,663     570,368     540,295
8      383,591     191,389     192,202
9   13,589,432   6,839,276   6,750,156
10   1,536,498     772,947     763,551
11   1,595,058     810,782     784,276
12   2,123,037   1,086,632   1,036,405
13   1,769,607     880,592     889,015
14   1,817,697     915,272     902,425
15   2,600,492   1,311,881   1,288,611
16   3,280,493   1,651,675   1,628,818
17     678,159     339,590     338,569